from ultralytics import YOLO


def main():
    model = YOLO("yolov8n-obb.pt")
    model.train(
        data="dataset/data.yaml",
        epochs=50,  # ตั้งรอบไว้พอดีๆ (ไม่น้อยและไม่เยอะเกินไป)
        patience=10,  # ถ้า 10 รอบไม่ดีขึ้น ให้หยุดทันทีเพื่อกันโมเดลพัง
        batch=4,  # ลด Batch Size ลง (เพราะข้อมูลน้อย การใช้แบตช์เล็กช่วยให้โมเดลอัปเดตน้ำหนักบ่อยขึ้น)
        imgsz=640,  # ขนาดภาพมาตรฐาน
        device=0,
        # --- พารามิเตอร์สำคัญสำหรับข้อมูลน้อย ---
        freeze=10,  # แช่แข็ง 10 เลเยอร์แรกไว้ เพื่อใช้ความรู้เดิมจาก Pre-trained model (yolov8n.pt) มองหาเส้นและขอบ
        lr0=0.001,  # ลด Learning Rate เริ่มต้นลง (จาก 0.01 เหลือ 0.001) ป้องกันไม่ให้โมเดลปรับค่าน้ำหนักแรงเกินไปจนหลุดโค้ง
        mosaic=1.0,  # เปิด Mosaic เต็มที่ เพื่อให้มันสุ่มตัดแปะภาพสร้างความหลากหลาย
        close_mosaic=5,  # ปิด Mosaic ใน 5 รอบสุดท้าย เพื่อให้โมเดลกลับมาโฟกัสภาพจริงแบบคมชัดก่อนจบการเทรน
        dropout=0.1,  # ใส่ Dropout เล็กน้อยเพื่อสุ่มตัดการเชื่อมต่อ ป้องกันการจำข้อสอบ (Overfitting)
        plots=True,  # เปิดไว้ดูราฟผลลัพธ์ในโฟลเดอร์ runs/
    )


if __name__ == "__main__":
    main()
